Show / Hide Table of Contents
Struct LoadImpulse
LoadImpulse
Inherited Members
 System.ValueType.Equals(System.Object)
 System.ValueType.GetHashCode()
 System.ValueType.ToString()
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetType()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
public struct LoadImpulse
Properties
Improve this Doc   View Source
X
Load in X direction
Declaration
public double X { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Y
Load in Y direction
Declaration
public double Y { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Z
Load in Z direction
Declaration
public double Z { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source